; domain
(define (domain p1)
(:requirements :strips :typing)

(:types 
    location 
    crate 
    content
    person
    drone
    arm
) 

(:predicates 
    (person-at ?person - person ?location - location)
    (is-injured ?person - person)
    (crate-at ?crate - crate ?location - location)
    (content-crate ?content - content ?crate - crate)
    (has-content-person ?person - person ?content - content)
    (person-need ?person - person ?content - content)
    (drone-at ?drone - drone ?location - location)
    (has-crate-drone-arm ?arm - arm ?crate - crate)
    (empty-arm ?arm - arm)
)

(:action pick-up-crate
    :parameters (
        ?crate - crate
        ?location - location
        ?drone - drone
        ?arm - arm
    )
    :precondition (and 
        (empty-arm ?arm)                 
        (drone-at ?drone ?location)       
        (crate-at ?crate ?location)           
    )
    :effect (and
        (has-crate-drone-arm ?arm ?crate)     
        (not (empty-arm ?arm))           
        (not (crate-at ?crate ?location))     
    )
)

(:action drone-move
    :parameters (
        ?location_from - location
        ?location_to - location
        ?drone - drone
    )
    :precondition (and 
        (drone-at ?drone ?location_from)  
    )
    :effect (and 
        (not (drone-at ?drone ?location_from)) 
        (drone-at ?drone ?location_to)         
    )
)

(:action drop-crate
    :parameters (
        ?location - location
        ?person - person
        ?crate - crate
        ?arm - arm
        ?content - content
        ?drone - drone
    )
    :precondition (and 
        (person-at ?person ?location)     
        (drone-at ?drone ?location)       
        (has-crate-drone-arm ?arm ?crate)     
        (content-crate ?content ?crate)       
        (person-need ?person ?content)    
    )
    :effect (and 
        (not (has-crate-drone-arm ?arm ?crate))   
        (has-content-person ?person ?content) 
        (empty-arm ?arm)                      
)
)
)

; problem
(define (problem drone_problem_d1_r0_l11_p11_c11_g11_ct2)
(:domain p1)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	food - content
	medicine - content
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	left right - arm
)
(:init
	(drone-at drone1 depot)
	(crate-at crate1 depot)
	(crate-at crate2 depot)
	(crate-at crate3 depot)
	(crate-at crate4 depot)
	(crate-at crate5 depot)
	(crate-at crate6 depot)
	(crate-at crate7 depot)
	(crate-at crate8 depot)
	(crate-at crate9 depot)
	(crate-at crate10 depot)
	(crate-at crate11 depot)
	(empty-arm left)
	(empty-arm right)
	(content-crate food crate1)
	(content-crate food crate2)
	(content-crate medicine crate3)
	(content-crate medicine crate4)
	(content-crate medicine crate5)
	(content-crate medicine crate6)
	(content-crate medicine crate7)
	(content-crate medicine crate8)
	(content-crate medicine crate9)
	(content-crate medicine crate10)
	(content-crate medicine crate11)
	(person-at person1 loc4)
	(person-at person2 loc6)
	(person-at person3 loc1)
	(person-at person4 loc4)
	(person-at person5 loc3)
	(person-at person6 loc2)
	(person-at person7 loc9)
	(person-at person8 loc6)
	(person-at person9 loc9)
	(person-at person10 loc10)
	(person-at person11 loc3)
	(person-need person1 medicine)
	(person-need person2 food)
	(person-need person2 medicine)
	(person-need person3 medicine)
	(person-need person4 medicine)
	(person-need person5 medicine)
	(person-need person6 medicine)
	(person-need person7 medicine)
	(person-need person10 medicine)
	(person-need person11 food)
	(person-need person11 medicine)
)
(:goal (and
	(drone-at drone1 depot)
	(has-content-person person1 medicine)
	(has-content-person person2 food)
	(has-content-person person2 medicine)
	(has-content-person person3 medicine)
	(has-content-person person4 medicine)
	(has-content-person person5 medicine)
	(has-content-person person6 medicine)
	(has-content-person person7 medicine)
	(has-content-person person10 medicine)
	(has-content-person person11 food)
	(has-content-person person11 medicine)
))
)

; plan
1. (pick-up-crate crate11 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate11 depot)
   added: (has-crate-drone-arm right crate11)
   goals met: 1 of 12
2. (pick-up-crate crate2 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate2 depot)
   added: (has-crate-drone-arm left crate2)
   goals met: 1 of 12
3. (drone-move depot loc10 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc10)
   goals met: 0 of 12
4. (drop-crate loc10 person10 crate11 right medicine drone1)
   deleted: (has-crate-drone-arm right crate11)
   added: (has-content-person person10 medicine) (empty-arm right)
   goals met: 1 of 12
5. (drone-move loc10 depot drone1)
   deleted: (drone-at drone1 loc10)
   added: (drone-at drone1 depot)
   goals met: 2 of 12
6. (pick-up-crate crate10 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate10 depot)
   added: (has-crate-drone-arm right crate10)
   goals met: 2 of 12
7. (drone-move depot loc9 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc9)
   goals met: 1 of 12
8. (drop-crate loc9 person7 crate10 right medicine drone1)
   deleted: (has-crate-drone-arm right crate10)
   added: (has-content-person person7 medicine) (empty-arm right)
   goals met: 2 of 12
9. (drone-move loc9 depot drone1)
   deleted: (drone-at drone1 loc9)
   added: (drone-at drone1 depot)
   goals met: 3 of 12
10. (pick-up-crate crate9 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate9 depot)
   added: (has-crate-drone-arm right crate9)
   goals met: 3 of 12
11. (drone-move depot loc2 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc2)
   goals met: 2 of 12
12. (drop-crate loc2 person6 crate9 right medicine drone1)
   deleted: (has-crate-drone-arm right crate9)
   added: (has-content-person person6 medicine) (empty-arm right)
   goals met: 3 of 12
13. (drone-move loc2 depot drone1)
   deleted: (drone-at drone1 loc2)
   added: (drone-at drone1 depot)
   goals met: 4 of 12
14. (pick-up-crate crate8 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate8 depot)
   added: (has-crate-drone-arm right crate8)
   goals met: 4 of 12
15. (drone-move depot loc1 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc1)
   goals met: 3 of 12
16. (drop-crate loc1 person3 crate8 right medicine drone1)
   deleted: (has-crate-drone-arm right crate8)
   added: (has-content-person person3 medicine) (empty-arm right)
   goals met: 4 of 12
17. (drone-move loc1 depot drone1)
   deleted: (drone-at drone1 loc1)
   added: (drone-at drone1 depot)
   goals met: 5 of 12
18. (pick-up-crate crate7 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate7 depot)
   added: (has-crate-drone-arm right crate7)
   goals met: 5 of 12
19. (drone-move depot loc6 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc6)
   goals met: 4 of 12
20. (drop-crate loc6 person2 crate2 left food drone1)
   deleted: (has-crate-drone-arm left crate2)
   added: (has-content-person person2 food) (empty-arm left)
   goals met: 5 of 12
21. (drop-crate loc6 person2 crate7 right medicine drone1)
   deleted: (has-crate-drone-arm right crate7)
   added: (has-content-person person2 medicine) (empty-arm right)
   goals met: 6 of 12
22. (drone-move loc6 depot drone1)
   deleted: (drone-at drone1 loc6)
   added: (drone-at drone1 depot)
   goals met: 7 of 12
23. (pick-up-crate crate6 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate6 depot)
   added: (has-crate-drone-arm right crate6)
   goals met: 7 of 12
24. (pick-up-crate crate1 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate1 depot)
   added: (has-crate-drone-arm left crate1)
   goals met: 7 of 12
25. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 6 of 12
26. (drop-crate loc3 person11 crate1 left food drone1)
   deleted: (has-crate-drone-arm left crate1)
   added: (has-content-person person11 food) (empty-arm left)
   goals met: 7 of 12
27. (drop-crate loc3 person5 crate6 right medicine drone1)
   deleted: (has-crate-drone-arm right crate6)
   added: (has-content-person person5 medicine) (empty-arm right)
   goals met: 8 of 12
28. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 9 of 12
29. (pick-up-crate crate5 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate5 depot)
   added: (has-crate-drone-arm right crate5)
   goals met: 9 of 12
30. (drone-move depot loc3 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc3)
   goals met: 8 of 12
31. (drop-crate loc3 person11 crate5 right medicine drone1)
   deleted: (has-crate-drone-arm right crate5)
   added: (has-content-person person11 medicine) (empty-arm right)
   goals met: 9 of 12
32. (drone-move loc3 depot drone1)
   deleted: (drone-at drone1 loc3)
   added: (drone-at drone1 depot)
   goals met: 10 of 12
33. (pick-up-crate crate4 depot drone1 right)
   deleted: (empty-arm right) (crate-at crate4 depot)
   added: (has-crate-drone-arm right crate4)
   goals met: 10 of 12
34. (pick-up-crate crate3 depot drone1 left)
   deleted: (empty-arm left) (crate-at crate3 depot)
   added: (has-crate-drone-arm left crate3)
   goals met: 10 of 12
35. (drone-move depot loc4 drone1)
   deleted: (drone-at drone1 depot)
   added: (drone-at drone1 loc4)
   goals met: 9 of 12
36. (drop-crate loc4 person1 crate3 left medicine drone1)
   deleted: (has-crate-drone-arm left crate3)
   added: (has-content-person person1 medicine) (empty-arm left)
   goals met: 10 of 12
37. (drop-crate loc4 person4 crate4 right medicine drone1)
   deleted: (has-crate-drone-arm right crate4)
   added: (has-content-person person4 medicine) (empty-arm right)
   goals met: 11 of 12
38. (drone-move loc4 depot drone1)
   deleted: (drone-at drone1 loc4)
   added: (drone-at drone1 depot)
   goals met: 12 of 12
